<?php  defined('C5_EXECUTE') or die("Access Denied."); ?>

<div id="agreement" class="text-center">
	<div class="container">
		<h3>ข้อตกลงในการใช้งาน </h3>
		<p>ข้อความทีท่านได้อ่านจาก เว็บเพจนี้ เกิดขึ้นจากการเขียนโดยสาธารณชน และ เผยแพร่โดยอัตโนมัติ ผู้ดูแลเว็บไซต์แห่งนี้ ไม่ได้เห็นด้วย และไม่ขอรับผิดชอบ ต่อข้อความใดๆทั้งสิ้น ดังนั้นผู้อ่านทุกท่าน โปรดใช้วิจารณญาณในการกลั่นกรองด้วยตนเอง และ ถ้าหากท่านพบเห็นข้อความใดๆ ที่ ขัดต่อกฎหมาย และ ศีลธรรม กรุณาแจ้งมาที่ webmasterเพื่อทีมงานจะได้ ดำเนินการในทันที ขอขอบพระคุณ</p>
	</div>
</div>
<footer id="footer">
	<div class="container">
		<div class="site-info">
			<a class="foo-logo" href="./"><svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 297.66 59.16">
				<g>
					<path d="M98.59,35.94,92.13,27.1a.46.46,0,0,0-.84.27v8.29a.47.47,0,0,1-.47.47H88.43a.47.47,0,0,1-.47-.47V21a.46.46,0,0,1,.47-.46h2.72a.47.47,0,0,1,.37.18l6.26,8.49a.47.47,0,0,0,.84-.28V21a.45.45,0,0,1,.46-.46h2.39a.46.46,0,0,1,.47.46V35.66a.47.47,0,0,1-.47.47H99A.47.47,0,0,1,98.59,35.94Z"/>
					<path d="M108.54,35.28V21.36a.84.84,0,0,1,.84-.84H111a.85.85,0,0,1,.85.84V35.28a.85.85,0,0,1-.85.85h-1.63A.84.84,0,0,1,108.54,35.28Z"/>
					<path d="M122.81,35.5V29.93a.6.6,0,0,0-.1-.35l-5.28-8.1a.62.62,0,0,1,.52-1h2.29a.62.62,0,0,1,.53.29l3.17,5.11a.63.63,0,0,0,1.07,0l3.12-5.1a.62.62,0,0,1,.54-.3H131a.62.62,0,0,1,.52,1l-5.24,8.1a.61.61,0,0,0-.1.34V35.5a.63.63,0,0,1-.63.63h-2.07A.63.63,0,0,1,122.81,35.5Z"/>
					<path d="M146.11,35.71l-.65-1.8a.63.63,0,0,0-.6-.43h-5.81a.66.66,0,0,0-.6.42l-.67,1.81a.64.64,0,0,1-.6.42h-2.41a.64.64,0,0,1-.6-.87l5.54-14.33a.65.65,0,0,1,.6-.41h3.29a.64.64,0,0,1,.6.41l5.52,14.33a.64.64,0,0,1-.6.87h-2.41A.64.64,0,0,1,146.11,35.71ZM141.35,25.5l-1.52,4.2a.64.64,0,0,0,.61.86h3a.64.64,0,0,0,.6-.86l-1.52-4.2A.65.65,0,0,0,141.35,25.5Z"/>
					<path d="M157.8,35.57V29.9a.55.55,0,0,0-.09-.3l-5.36-8.22a.55.55,0,0,1,.46-.86h2.46a.56.56,0,0,1,.47.26L159,26a.56.56,0,0,0,.95,0l3.2-5.24a.56.56,0,0,1,.47-.26h2.46a.56.56,0,0,1,.47.86l-5.33,8.22a.65.65,0,0,0-.09.3v5.67a.56.56,0,0,1-.55.56h-2.21A.56.56,0,0,1,157.8,35.57Z"/>
					<path d="M181.18,33l.31-.44a1.27,1.27,0,0,1,1.79-.29,6.89,6.89,0,0,0,4,1.26c1.82,0,2.71-.84,2.71-1.73,0-1.15-1.45-1.48-3.16-1.9C184.27,29.29,181,28.59,181,25c0-2.6,2.25-4.75,5.92-4.75a9.18,9.18,0,0,1,5,1.36,1.27,1.27,0,0,1,.28,1.83l-.31.41a1.3,1.3,0,0,1-1.73.29,6.91,6.91,0,0,0-3.58-1c-1.43,0-2.22.64-2.22,1.57s1.42,1.34,3.11,1.73c2.57.61,5.85,1.39,5.85,4.92,0,2.86-2,5-6.25,5a9.35,9.35,0,0,1-5.68-1.68A1.26,1.26,0,0,1,181.18,33Z"/>
					<path d="M198.36,28.33a8.16,8.16,0,0,1,16.31,0,8.16,8.16,0,0,1-16.31,0Zm12.9,0c0-2.92-1.88-5.12-4.76-5.12s-4.73,2.2-4.73,5.12,1.85,5.13,4.73,5.13S211.26,31.24,211.26,28.33Z"/>
					<path d="M219.77,28.33c0-4.79,3.63-8.07,8.31-8.07a7,7,0,0,1,5.66,2.55,1.24,1.24,0,0,1-.41,1.9l-.61.3a1.22,1.22,0,0,1-1.46-.28,4.21,4.21,0,0,0-3.18-1.52,4.86,4.86,0,0,0-4.89,5.12,4.86,4.86,0,0,0,4.89,5.13,4.18,4.18,0,0,0,3.19-1.52,1.19,1.19,0,0,1,1.45-.28l.59.28a1.24,1.24,0,0,1,.42,1.9,7,7,0,0,1-5.65,2.57A7.94,7.94,0,0,1,219.77,28.33Z"/>
					<path d="M240.11,35.54V21.11a.58.58,0,0,1,.59-.59h2.14a.58.58,0,0,1,.59.59V35.54a.58.58,0,0,1-.59.59H240.7A.58.58,0,0,1,240.11,35.54Z"/>
					<path d="M250,35.56V21.08a.56.56,0,0,1,.57-.56h9.91a.56.56,0,0,1,.57.56v1.8a.56.56,0,0,1-.57.56h-6.59a.57.57,0,0,0-.57.57v2.17a.57.57,0,0,0,.57.56h6.43a.58.58,0,0,1,.57.57V29.1a.57.57,0,0,1-.57.57h-6.43a.57.57,0,0,0-.57.56v2.41a.57.57,0,0,0,.57.56h6.59a.57.57,0,0,1,.57.57v1.79a.56.56,0,0,1-.57.57H250.6A.56.56,0,0,1,250,35.56Z"/>
					<path d="M270.79,35.65V23.92a.49.49,0,0,0-.48-.48h-3.6a.48.48,0,0,1-.49-.48V21a.48.48,0,0,1,.49-.48H278.2a.48.48,0,0,1,.48.48v2a.48.48,0,0,1-.48.48h-3.58a.48.48,0,0,0-.48.48V35.65a.49.49,0,0,1-.48.48h-2.39A.49.49,0,0,1,270.79,35.65Z"/>
					<path d="M288.67,35.76V29.85a.36.36,0,0,0-.06-.2L283,21.09a.37.37,0,0,1,.31-.57h2.91a.34.34,0,0,1,.31.17L290,26.28a.36.36,0,0,0,.62,0l3.42-5.59a.37.37,0,0,1,.32-.17h2.91a.37.37,0,0,1,.31.56l-5.55,8.57a.36.36,0,0,0-.06.2v5.91a.36.36,0,0,1-.36.37H289A.36.36,0,0,1,288.67,35.76Z"/>
					<path d="M35,6.71V59.16c-10.43-2.5-21.25-4.65-31.54-7.27C.93,51.24.09,50.1.07,47.25c0-1.58,0-3.18,0-4.8,0-.75,0-1.51,0-2.26H7.29a3,3,0,0,0,2-.74,2.34,2.34,0,0,0,.84-1.77,2.71,2.71,0,0,0-2.85-2.52H0V33.88H11.77a2.45,2.45,0,0,0,1.74-.73,2.6,2.6,0,0,0,.71-1.78,2.47,2.47,0,0,0-2.45-2.51H0V27.57H14.15A2.62,2.62,0,0,0,16,26.84a2.49,2.49,0,0,0,.74-1.78,2.54,2.54,0,0,0-2.56-2.51H0V21.26H8a3.1,3.1,0,0,0,2-.73,2.4,2.4,0,0,0,.83-1.78A2.7,2.7,0,0,0,8,16.24H0c0-.25,0-.49,0-.74,0-3.66,0-7.27.07-10.79C.13,1,1.79-.46,5.14.13,14.81,1.83,25.15,4.71,35,6.71Z"/>
					<path d="M61.72,22.05a5.81,5.81,0,1,1-5.8-5.81A5.81,5.81,0,0,1,61.72,22.05Z"/><path class="cls-1" d="M66.91,24.67a11.31,11.31,0,1,0-2.84,5.21L70,32.93v2.21c0,4.11,0,8.17-.06,12.11,0,2.85-.86,4-3.4,4.63C56.26,54.51,45.43,56.66,35,59.15V6.71c9.85-2,20.18-4.88,29.86-6.58,3.34-.59,5,.83,5,4.58C70,10.91,70,17.42,70,24c0,.77,0,1.53,0,2.3Z"/>
				</g>
			</svg></a>
			<div class="contact-info">
				<ul class="foo-social">
					<li><a href="#" target="_blank"><img src="<?php echo $this->getThemePath(); ?>/img/foot_fb.png" alt="Facebook Page"></a></li>
					<li><a href="#" target="_blank"><img src="<?php echo $this->getThemePath(); ?>/img/foot_tw.png" alt="Twitter"></a></li>
					<li><a href="#" target="_blank"><img src="<?php echo $this->getThemePath(); ?>/img/foot_ig.png" alt="Instagram"></a></li>
				</ul>
				<div class="email-contact"><a href="mailto:webmaster@niyaysociety.com">webmaster@niyaysociety.com</a></div>
				<ul class="contact">
					<li><a href="/about-us">เกี่ยวกับเรา</a></li>
					<li><a href="/contact-us">ติดต่อเรา</a></li>
				</ul>
			</div>
			<div class="copyright">@2020 Niyay Society อาณาจักรคนรักนิยาย.</div>
		</div>
		<div class="nav-foo">
			<nav class="nav-col">
				<h3>นิยาย</h3>
				<ul>
					<li><a href="/all-niyay/drama">ดราม่า</a></li>
					<li><a href="/all-niyay/romantic">โรแมนติก</a></li>
					<li><a href="/all-niyay/comedy">คอมเมดี้</a></li>
					<li><a href="/all-niyay/erotic">อีโรติก</a></li>
					<li><a href="/all-niyay/fantasy">แฟนตาซี</a></li>
					<li><a href="/all-niyay/investigate">สืบสวนสอบสวน</a></li>
					<li><a href="/all-niyay/action">ต่อสู้</a></li>
					<li><a href="/all-niyay/y">นิยาย Y</a></li>
					<li><a href="/all-niyay/fanfic">แฟนฟิค</a></li>
				</ul>
			</nav>
			<nav class="nav-col">
				<h3>ความช่วยเหลือ</h3>
				<ul>
					<li><a href="/howto">วิธีเขียนนิยาย</a></li>
					<li><a href="/terms">ข้อตกลงในการใช้งาน</a></li>
					<li><a href="/sitemap">แผนผังเว็บไซต์</a></li>
					<li><a href="/privacy-policy">นโยบายความเป็นส่วนตัว</a></li>
				</ul>
			</nav>
			<nav class="nav-col">
				<h3>เมนูทั่วไป</h3>
				<ul class="main-menu">
					<li><a href="//blog.niyaysociety.com">บทความ</a></li>
					<li><a href="/writers">นักเขียน</a></li>
					<li><a href="/profile">โปรไฟล์</a></li>
					<li><a href="/profile">นิยายของฉัน</a></li>
					<li><a href="/profile/friends">เพื่อนนักเขียน</a></li>
				</ul>
			</nav>
		</div>
	</div>
</footer>

<?php include('themes/niyaysociety2020/inc/foot_inc.php'); ?>

<!-- Facebook Sharing -->
<div id="fb-root"></div>
<script>(function(d, s, id) {
  var js, fjs = d.getElementsByTagName(s)[0];
  if (d.getElementById(id)) return;
  js = d.createElement(s); js.id = id;
  js.src = "//connect.facebook.net/en_US/sdk.js#xfbml=1&version=v2.8&appId=1866929160193121";
  fjs.parentNode.insertBefore(js, fjs);
}(document, 'script', 'facebook-jssdk'));</script>

<?php Loader::element('footer_required'); ?>
</body>
</html>
